TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
/*
 * Copyright (C) 2022-2023 Texas Instruments Incorporated
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 *   Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in the
 *   documentation and/or other materials provided with the
 *   distribution.
 *
 *   Neither the name of Texas Instruments Incorporated nor the names of
 *   its contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef ADC_REG_H_
#define ADC_REG_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "Std_Types.h"

/**************************************************************************
 * Hardware Region  :
 **************************************************************************/

/**************************************************************************
 * Register Overlay Structure
 **************************************************************************/

typedef struct
{
    volatile uint16 ADCCTL1;
    volatile uint16 ADCCTL2;
    volatile uint16 ADCBURSTCTL;
    volatile uint16 ADCINTFLG;
    volatile uint16 ADCINTFLGCLR;
    volatile uint16 ADCINTOVF;
    volatile uint16 ADCINTOVFCLR;
    volatile uint16 ADCINTSEL1N2;
    volatile uint16 ADCINTSEL3N4;
    volatile uint16 ADCSOCPRICTL;
    volatile uint16 ADCINTSOCSEL1;
    volatile uint16 ADCINTSOCSEL2;
    volatile uint16 ADCSOCFLG1;
    volatile uint16 ADCSOCFRC1;
    volatile uint16 ADCSOCOVF1;
    volatile uint16 ADCSOCOVFCLR1;
    volatile uint32 ADCSOC0CTL;
    volatile uint32 ADCSOC1CTL;
    volatile uint32 ADCSOC2CTL;
    volatile uint32 ADCSOC3CTL;
    volatile uint32 ADCSOC4CTL;
    volatile uint32 ADCSOC5CTL;
    volatile uint32 ADCSOC6CTL;
    volatile uint32 ADCSOC7CTL;
    volatile uint32 ADCSOC8CTL;
    volatile uint32 ADCSOC9CTL;
    volatile uint32 ADCSOC10CTL;
    volatile uint32 ADCSOC11CTL;
    volatile uint32 ADCSOC12CTL;
    volatile uint32 ADCSOC13CTL;
    volatile uint32 ADCSOC14CTL;
    volatile uint32 ADCSOC15CTL;
    volatile uint16 ADCEVTSTAT;
    volatile uint8  Resv_100[2];
    volatile uint16 ADCEVTCLR;
    volatile uint8  Resv_104[2];
    volatile uint16 ADCEVTSEL;
    volatile uint8  Resv_108[2];
    volatile uint16 ADCEVTINTSEL;
    volatile uint8  Resv_112[2];
    volatile uint16 ADCOSDETECT;
    volatile uint16 ADCCOUNTER;
    volatile uint16 ADCREV;
    volatile uint16 ADCOFFTRIM;
    volatile uint8  Resv_124[4];
    volatile uint32 ADCCONFIG;
    volatile uint16 ADCPPB1CONFIG;
    volatile uint16 ADCPPB1STAMP;
    volatile uint16 ADCPPB1OFFCAL;
    volatile uint16 ADCPPB1OFFREF;
    volatile uint32 ADCPPB1TRIPHI;
    volatile uint32 ADCPPB1TRIPLO;
    volatile uint16 ADCPPB2CONFIG;
    volatile uint16 ADCPPB2STAMP;
    volatile uint16 ADCPPB2OFFCAL;
    volatile uint16 ADCPPB2OFFREF;
    volatile uint32 ADCPPB2TRIPHI;
    volatile uint32 ADCPPB2TRIPLO;
    volatile uint16 ADCPPB3CONFIG;
    volatile uint16 ADCPPB3STAMP;
    volatile uint16 ADCPPB3OFFCAL;
    volatile uint16 ADCPPB3OFFREF;
    volatile uint32 ADCPPB3TRIPHI;
    volatile uint32 ADCPPB3TRIPLO;
    volatile uint16 ADCPPB4CONFIG;
    volatile uint16 ADCPPB4STAMP;
    volatile uint16 ADCPPB4OFFCAL;
    volatile uint16 ADCPPB4OFFREF;
    volatile uint32 ADCPPB4TRIPHI;
    volatile uint32 ADCPPB4TRIPLO;
    volatile uint8  Resv_222[30];
    volatile uint16 ADCINTCYCLE;
    volatile uint32 ADCINLTRIM1;
    volatile uint32 ADCINLTRIM2;
    volatile uint32 ADCINLTRIM3;
    volatile uint32 ADCINLTRIM4;
    volatile uint32 ADCINLTRIM5;
    volatile uint32 ADCINLTRIM6;
    volatile uint8  Resv_252[4];
    volatile uint32 ADCINLTRIMCTL;
} MCAL_CSL_ADCRegs;

/**************************************************************************
 * Register Macros
 **************************************************************************/

#define MCAL_CSL_ADC_ADCCTL1       (0x00000000U)
#define MCAL_CSL_ADC_ADCCTL2       (0x00000002U)
#define MCAL_CSL_ADC_ADCBURSTCTL   (0x00000004U)
#define MCAL_CSL_ADC_ADCINTFLG     (0x00000006U)
#define MCAL_CSL_ADC_ADCINTFLGCLR  (0x00000008U)
#define MCAL_CSL_ADC_ADCINTOVF     (0x0000000AU)
#define MCAL_CSL_ADC_ADCINTOVFCLR  (0x0000000CU)
#define MCAL_CSL_ADC_ADCINTSEL1N2  (0x0000000EU)
#define MCAL_CSL_ADC_ADCINTSEL3N4  (0x00000010U)
#define MCAL_CSL_ADC_ADCSOCPRICTL  (0x00000012U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1 (0x00000014U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2 (0x00000016U)
#define MCAL_CSL_ADC_ADCSOCFLG1    (0x00000018U)
#define MCAL_CSL_ADC_ADCSOCFRC1    (0x0000001AU)
#define MCAL_CSL_ADC_ADCSOCOVF1    (0x0000001CU)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1 (0x0000001EU)
#define MCAL_CSL_ADC_ADCSOC0CTL    (0x00000020U)
#define MCAL_CSL_ADC_ADCSOC1CTL    (0x00000024U)
#define MCAL_CSL_ADC_ADCSOC2CTL    (0x00000028U)
#define MCAL_CSL_ADC_ADCSOC3CTL    (0x0000002CU)
#define MCAL_CSL_ADC_ADCSOC4CTL    (0x00000030U)
#define MCAL_CSL_ADC_ADCSOC5CTL    (0x00000034U)
#define MCAL_CSL_ADC_ADCSOC6CTL    (0x00000038U)
#define MCAL_CSL_ADC_ADCSOC7CTL    (0x0000003CU)
#define MCAL_CSL_ADC_ADCSOC8CTL    (0x00000040U)
#define MCAL_CSL_ADC_ADCSOC9CTL    (0x00000044U)
#define MCAL_CSL_ADC_ADCSOC10CTL   (0x00000048U)
#define MCAL_CSL_ADC_ADCSOC11CTL   (0x0000004CU)
#define MCAL_CSL_ADC_ADCSOC12CTL   (0x00000050U)
#define MCAL_CSL_ADC_ADCSOC13CTL   (0x00000054U)
#define MCAL_CSL_ADC_ADCSOC14CTL   (0x00000058U)
#define MCAL_CSL_ADC_ADCSOC15CTL   (0x0000005CU)
#define MCAL_CSL_ADC_ADCEVTSTAT    (0x00000060U)
#define MCAL_CSL_ADC_ADCEVTCLR     (0x00000064U)
#define MCAL_CSL_ADC_ADCEVTSEL     (0x00000068U)
#define MCAL_CSL_ADC_ADCEVTINTSEL  (0x0000006CU)
#define MCAL_CSL_ADC_ADCOSDETECT   (0x00000070U)
#define MCAL_CSL_ADC_ADCCOUNTER    (0x00000072U)
#define MCAL_CSL_ADC_ADCREV        (0x00000074U)
#define MCAL_CSL_ADC_ADCOFFTRIM    (0x00000076U)
#define MCAL_CSL_ADC_ADCCONFIG     (0x0000007CU)
#define MCAL_CSL_ADC_ADCPPB1CONFIG (0x00000080U)
#define MCAL_CSL_ADC_ADCPPB1STAMP  (0x00000082U)
#define MCAL_CSL_ADC_ADCPPB1OFFCAL (0x00000084U)
#define MCAL_CSL_ADC_ADCPPB1OFFREF (0x00000086U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI (0x00000088U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO (0x0000008CU)
#define MCAL_CSL_ADC_ADCPPB2CONFIG (0x00000090U)
#define MCAL_CSL_ADC_ADCPPB2STAMP  (0x00000092U)
#define MCAL_CSL_ADC_ADCPPB2OFFCAL (0x00000094U)
#define MCAL_CSL_ADC_ADCPPB2OFFREF (0x00000096U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI (0x00000098U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO (0x0000009CU)
#define MCAL_CSL_ADC_ADCPPB3CONFIG (0x000000A0U)
#define MCAL_CSL_ADC_ADCPPB3STAMP  (0x000000A2U)
#define MCAL_CSL_ADC_ADCPPB3OFFCAL (0x000000A4U)
#define MCAL_CSL_ADC_ADCPPB3OFFREF (0x000000A6U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI (0x000000A8U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO (0x000000ACU)
#define MCAL_CSL_ADC_ADCPPB4CONFIG (0x000000B0U)
#define MCAL_CSL_ADC_ADCPPB4STAMP  (0x000000B2U)
#define MCAL_CSL_ADC_ADCPPB4OFFCAL (0x000000B4U)
#define MCAL_CSL_ADC_ADCPPB4OFFREF (0x000000B6U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI (0x000000B8U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO (0x000000BCU)
#define MCAL_CSL_ADC_ADCINTCYCLE   (0x000000DEU)
#define MCAL_CSL_ADC_ADCINLTRIM1   (0x000000E0U)
#define MCAL_CSL_ADC_ADCINLTRIM2   (0x000000E4U)
#define MCAL_CSL_ADC_ADCINLTRIM3   (0x000000E8U)
#define MCAL_CSL_ADC_ADCINLTRIM4   (0x000000ECU)
#define MCAL_CSL_ADC_ADCINLTRIM5   (0x000000F0U)
#define MCAL_CSL_ADC_ADCINLTRIM6   (0x000000F4U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL (0x000000FCU)

/**************************************************************************
 * Field Definition Macros
 **************************************************************************/

#define MCAL_CONTROLSS_ADC0_RESULT 0x50100000UL
#define MCAL_CONTROLSS_ADC1_RESULT 0x50101000UL
#define MCAL_CONTROLSS_ADC2_RESULT 0x50102000UL
#define MCAL_CONTROLSS_ADC3_RESULT 0x50103000UL
#define MCAL_CONTROLSS_ADC4_RESULT 0x50104000UL

/* This is for resolver ADC */
#define MCAL_CONTROLSS_ADCR0_RESULT 0x502C6000UL
#define MCAL_CONTROLSS_ADCR1_RESULT 0x502C8000UL

/* ADCCTL1 */

