TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_1_MASK     (0x0003U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_1_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_1_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCCTL1_INTPULSEPOS_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCCTL1_INTPULSEPOS_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCCTL1_INTPULSEPOS_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_INTPULSEPOS_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCCTL1_RESERVED_2_MASK     (0x0078U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_2_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_2_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCCTL1_ADCPWDNZ_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCCTL1_ADCPWDNZ_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCCTL1_ADCPWDNZ_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_ADCPWDNZ_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCCTL1_ADCBSYCHN_MASK     (0x0F00U)
#define MCAL_CSL_ADC_ADCCTL1_ADCBSYCHN_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCCTL1_ADCBSYCHN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_ADCBSYCHN_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCCTL1_RESERVED_3_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_3_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCCTL1_ADCBSY_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCCTL1_ADCBSY_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCCTL1_ADCBSY_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_ADCBSY_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCCTL1_RESERVED_4_MASK     (0xC000U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_4_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL1_RESERVED_4_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCCTL1_RESETVAL (0x0000U)

/* ADCCTL2 */

#define MCAL_CSL_ADC_ADCCTL2_PRESCALE_MASK     (0x000FU)
#define MCAL_CSL_ADC_ADCCTL2_PRESCALE_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCCTL2_PRESCALE_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL2_PRESCALE_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCCTL2_RESERVED_1_MASK     (0x0030U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_1_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_1_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCCTL2_RESOLUTION_MASK     (0x0040U)
#define MCAL_CSL_ADC_ADCCTL2_RESOLUTION_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCCTL2_RESOLUTION_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL2_RESOLUTION_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCCTL2_SIGNALMODE_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCCTL2_SIGNALMODE_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCCTL2_SIGNALMODE_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL2_SIGNALMODE_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCCTL2_RESERVED_2_MASK     (0x1F00U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_2_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_2_MAX      (0x001FU)

#define MCAL_CSL_ADC_ADCCTL2_RESERVED_3_MASK     (0xE000U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_3_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCTL2_RESERVED_3_MAX      (0x0007U)

#define MCAL_CSL_ADC_ADCCTL2_RESETVAL (0x0000U)

/* ADCBURSTCTL */

#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTTRIGSEL_MASK     (0x007FU)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTTRIGSEL_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTTRIGSEL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTTRIGSEL_MAX      (0x007FU)

#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_1_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_1_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTSIZE_MASK     (0x0F00U)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTSIZE_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTSIZE_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTSIZE_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_2_MASK     (0x7000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_2_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_RESERVED_2_MAX      (0x0007U)

#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTEN_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTEN_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCBURSTCTL_BURSTEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCBURSTCTL_RESETVAL (0x0000U)

/* ADCINTFLG */

#define MCAL_CSL_ADC_ADCINTFLG_ADCINT1_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT1_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLG_ADCINT2_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT2_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLG_ADCINT3_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT3_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLG_ADCINT4_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT4_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLG_ADCINT4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLG_RESERVED_1_MASK     (0xFFF0U)
#define MCAL_CSL_ADC_ADCINTFLG_RESERVED_1_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTFLG_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLG_RESERVED_1_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCINTFLG_RESETVAL (0x0000U)

/* ADCINTFLGCLR */

#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT1_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT1_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT2_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT2_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT3_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT3_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT4_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT4_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_ADCINT4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTFLGCLR_RESERVED_1_MASK     (0xFFF0U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_RESERVED_1_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTFLGCLR_RESERVED_1_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCINTFLGCLR_RESETVAL (0x0000U)

/* ADCINTOVF */

#define MCAL_CSL_ADC_ADCINTOVF_ADCINT1_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT1_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTOVF_ADCINT2_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT2_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTOVF_ADCINT3_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT3_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTOVF_ADCINT4_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT4_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVF_ADCINT4_MAX      (0x0001U)

