TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCINTOVF_RESERVED_1_MASK     (0xFFF0U)
#define MCAL_CSL_ADC_ADCINTOVF_RESERVED_1_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTOVF_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVF_RESERVED_1_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCINTOVF_RESETVAL (0x0000U)

/* ADCINTOVFCLR */

#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT1_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT1_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT2_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT2_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT3_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT3_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT4_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT4_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_ADCINT4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTOVFCLR_RESERVED_1_MASK     (0xFFF0U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_RESERVED_1_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTOVFCLR_RESERVED_1_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCINTOVFCLR_RESETVAL (0x0000U)

/* ADCINTSEL1N2 */

#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1SEL_MASK     (0x000FU)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1SEL_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1SEL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1SEL_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_1_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_1_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1E_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1E_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1E_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1E_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1CONT_MASK     (0x0040U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1CONT_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1CONT_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT1CONT_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_2_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_2_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2SEL_MASK     (0x0F00U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2SEL_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2SEL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2SEL_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_3_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_3_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2E_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2E_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2E_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2E_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2CONT_MASK     (0x4000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2CONT_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2CONT_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_INT2CONT_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_4_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_4_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL1N2_RESERVED_4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL1N2_RESETVAL (0x0000U)

/* ADCINTSEL3N4 */

#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3SEL_MASK     (0x000FU)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3SEL_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3SEL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3SEL_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_1_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_1_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3E_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3E_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3E_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3E_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3CONT_MASK     (0x0040U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3CONT_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3CONT_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT3CONT_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_2_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_2_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4SEL_MASK     (0x0F00U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4SEL_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4SEL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4SEL_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_3_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_3_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4E_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4E_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4E_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4E_MAX      (0x0001U)

