TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4CONT_MASK     (0x4000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4CONT_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4CONT_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_INT4CONT_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_4_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_4_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSEL3N4_RESERVED_4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCINTSEL3N4_RESETVAL (0x0000U)

/* ADCSOCPRICTL */

#define MCAL_CSL_ADC_ADCSOCPRICTL_SOCPRIORITY_MASK     (0x001FU)
#define MCAL_CSL_ADC_ADCSOCPRICTL_SOCPRIORITY_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCSOCPRICTL_SOCPRIORITY_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCPRICTL_SOCPRIORITY_MAX      (0x001FU)

#define MCAL_CSL_ADC_ADCSOCPRICTL_RRPOINTER_MASK     (0x03E0U)
#define MCAL_CSL_ADC_ADCSOCPRICTL_RRPOINTER_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCSOCPRICTL_RRPOINTER_RESETVAL (0x0010U)
#define MCAL_CSL_ADC_ADCSOCPRICTL_RRPOINTER_MAX      (0x001FU)

#define MCAL_CSL_ADC_ADCSOCPRICTL_RESERVED_1_MASK     (0xFC00U)
#define MCAL_CSL_ADC_ADCSOCPRICTL_RESERVED_1_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCSOCPRICTL_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCPRICTL_RESERVED_1_MAX      (0x003FU)

#define MCAL_CSL_ADC_ADCSOCPRICTL_RESETVAL (0x0200U)

/* ADCINTSOCSEL1 */

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC0_MASK     (0x0003U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC0_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC0_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC0_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC1_MASK     (0x000CU)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC1_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC1_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC2_MASK     (0x0030U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC2_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC2_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC3_MASK     (0x00C0U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC3_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC3_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC4_MASK     (0x0300U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC4_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC4_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC5_MASK     (0x0C00U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC5_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC5_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC5_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC6_MASK     (0x3000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC6_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC6_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC6_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC7_MASK     (0xC000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC7_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC7_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL1_SOC7_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL1_RESETVAL (0x0000U)

/* ADCINTSOCSEL2 */

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC8_MASK     (0x0003U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC8_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC8_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC8_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC9_MASK     (0x000CU)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC9_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC9_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC9_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC10_MASK     (0x0030U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC10_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC10_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC10_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC11_MASK     (0x00C0U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC11_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC11_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC11_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC12_MASK     (0x0300U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC12_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC12_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC12_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC13_MASK     (0x0C00U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC13_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC13_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC13_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC14_MASK     (0x3000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC14_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC14_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC14_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC15_MASK     (0xC000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC15_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC15_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTSOCSEL2_SOC15_MAX      (0x0003U)

#define MCAL_CSL_ADC_ADCINTSOCSEL2_RESETVAL (0x0000U)

/* ADCSOCFLG1 */

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC0_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC0_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC0_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC0_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC1_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC1_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC2_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC2_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC2_MAX      (0x0001U)

