TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC3_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC3_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC4_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC4_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC5_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC5_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC5_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC5_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC6_MASK     (0x0040U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC6_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC6_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC6_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC7_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC7_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC7_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC7_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC8_MASK     (0x0100U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC8_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC8_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC8_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC9_MASK     (0x0200U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC9_SHIFT    (0x0009U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC9_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC9_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC10_MASK     (0x0400U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC10_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC10_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC10_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC11_MASK     (0x0800U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC11_SHIFT    (0x000BU)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC11_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC11_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC12_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC12_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC12_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC12_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC13_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC13_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC13_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC13_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC14_MASK     (0x4000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC14_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC14_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC14_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_SOC15_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC15_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC15_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFLG1_SOC15_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFLG1_RESETVAL (0x0000U)

/* ADCSOCFRC1 */

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC0_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC0_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC0_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC0_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC1_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC1_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC2_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC2_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC3_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC3_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC4_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC4_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC5_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC5_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC5_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC5_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC6_MASK     (0x0040U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC6_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC6_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC6_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC7_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC7_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC7_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC7_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC8_MASK     (0x0100U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC8_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC8_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC8_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC9_MASK     (0x0200U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC9_SHIFT    (0x0009U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC9_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC9_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC10_MASK     (0x0400U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC10_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC10_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC10_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC11_MASK     (0x0800U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC11_SHIFT    (0x000BU)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC11_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC11_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC12_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC12_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC12_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC12_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCFRC1_SOC13_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC13_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC13_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCFRC1_SOC13_MAX      (0x0001U)

