TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC8_MASK     (0x0100U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC8_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC8_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC8_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC9_MASK     (0x0200U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC9_SHIFT    (0x0009U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC9_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC9_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC10_MASK     (0x0400U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC10_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC10_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC10_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC11_MASK     (0x0800U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC11_SHIFT    (0x000BU)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC11_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC11_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC12_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC12_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC12_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC12_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC13_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC13_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC13_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC13_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC14_MASK     (0x4000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC14_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC14_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC14_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC15_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC15_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC15_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCSOCOVFCLR1_SOC15_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCSOCOVFCLR1_RESETVAL (0x0000U)

/* ADCSOC0CTL */

#define MCAL_CSL_ADC_ADCSOC0CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC0CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC0CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC0CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC0CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC0CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC0CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC0CTL_RESETVAL (0x00000000U)

/* ADCSOC1CTL */

#define MCAL_CSL_ADC_ADCSOC1CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC1CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC1CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC1CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC1CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC1CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC1CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC1CTL_RESETVAL (0x00000000U)

/* ADCSOC2CTL */

#define MCAL_CSL_ADC_ADCSOC2CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC2CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC2CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC2CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC2CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC2CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC2CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC2CTL_RESETVAL (0x00000000U)

