TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
/* ADCSOC3CTL */

#define MCAL_CSL_ADC_ADCSOC3CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC3CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC3CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC3CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC3CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC3CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC3CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC3CTL_RESETVAL (0x00000000U)

/* ADCSOC4CTL */

#define MCAL_CSL_ADC_ADCSOC4CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC4CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC4CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC4CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC4CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC4CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC4CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC4CTL_RESETVAL (0x00000000U)

/* ADCSOC5CTL */

#define MCAL_CSL_ADC_ADCSOC5CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC5CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC5CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC5CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC5CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC5CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC5CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC5CTL_RESETVAL (0x00000000U)

/* ADCSOC6CTL */

#define MCAL_CSL_ADC_ADCSOC6CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC6CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC6CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC6CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC6CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC6CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC6CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC6CTL_RESETVAL (0x00000000U)

/* ADCSOC7CTL */

#define MCAL_CSL_ADC_ADCSOC7CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC7CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC7CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC7CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_CHSEL_MAX      (0x0000001FU)

