TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCSOC7CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC7CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC7CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC7CTL_RESETVAL (0x00000000U)

/* ADCSOC8CTL */

#define MCAL_CSL_ADC_ADCSOC8CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC8CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC8CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC8CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC8CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC8CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC8CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC8CTL_RESETVAL (0x00000000U)

/* ADCSOC9CTL */

#define MCAL_CSL_ADC_ADCSOC9CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC9CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC9CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC9CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC9CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC9CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC9CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC9CTL_RESETVAL (0x00000000U)

/* ADCSOC10CTL */

#define MCAL_CSL_ADC_ADCSOC10CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC10CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC10CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC10CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC10CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC10CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC10CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC10CTL_RESETVAL (0x00000000U)

/* ADCSOC11CTL */

#define MCAL_CSL_ADC_ADCSOC11CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC11CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC11CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC11CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC11CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC11CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC11CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC11CTL_RESETVAL (0x00000000U)

