TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
/* ADCSOC12CTL */

#define MCAL_CSL_ADC_ADCSOC12CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC12CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC12CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC12CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC12CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC12CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC12CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC12CTL_RESETVAL (0x00000000U)

/* ADCSOC13CTL */

#define MCAL_CSL_ADC_ADCSOC13CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC13CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC13CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC13CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC13CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC13CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC13CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC13CTL_RESETVAL (0x00000000U)

/* ADCSOC14CTL */

#define MCAL_CSL_ADC_ADCSOC14CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC14CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC14CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC14CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC14CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC14CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC14CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC14CTL_RESETVAL (0x00000000U)

/* ADCSOC15CTL */

#define MCAL_CSL_ADC_ADCSOC15CTL_ACQPS_MASK     (0x000001FFU)
#define MCAL_CSL_ADC_ADCSOC15CTL_ACQPS_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_ACQPS_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_ACQPS_MAX      (0x000001FFU)

#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_1_MASK     (0x00007E00U)
#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_1_SHIFT    (0x00000009U)
#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_1_MAX      (0x0000003FU)

#define MCAL_CSL_ADC_ADCSOC15CTL_CHSEL_MASK     (0x000F8000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_CHSEL_SHIFT    (0x0000000FU)
#define MCAL_CSL_ADC_ADCSOC15CTL_CHSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_CHSEL_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC15CTL_TRIGSEL_MASK     (0x07F00000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_TRIGSEL_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCSOC15CTL_TRIGSEL_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_TRIGSEL_MAX      (0x0000007FU)

#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_2_MASK     (0xF8000000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_2_SHIFT    (0x0000001BU)
#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_2_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCSOC15CTL_RESERVED_2_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCSOC15CTL_RESETVAL (0x00000000U)

/* ADCEVTSTAT */

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPHI_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPHI_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPLO_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPLO_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1ZERO_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1ZERO_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB1ZERO_MAX      (0x0001U)

