TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_1_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_1_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPHI_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPHI_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPLO_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPLO_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2ZERO_MASK     (0x0040U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2ZERO_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB2ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_2_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_2_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPHI_MASK     (0x0100U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPHI_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPLO_MASK     (0x0200U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPLO_SHIFT    (0x0009U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3ZERO_MASK     (0x0400U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3ZERO_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB3ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_3_MASK     (0x0800U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_3_SHIFT    (0x000BU)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPHI_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPHI_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPLO_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPLO_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4ZERO_MASK     (0x4000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4ZERO_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_PPB4ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_4_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_4_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSTAT_RESERVED_4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSTAT_RESETVAL (0x0000U)

/* ADCEVTCLR */

#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPHI_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPHI_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPLO_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPLO_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB1ZERO_MASK     (0x0004U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1ZERO_SHIFT    (0x0002U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB1ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_1_MASK     (0x0008U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_1_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_1_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPHI_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPHI_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPLO_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPLO_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB2ZERO_MASK     (0x0040U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2ZERO_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB2ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_2_MASK     (0x0080U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_2_SHIFT    (0x0007U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_2_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_2_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPHI_MASK     (0x0100U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPHI_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPLO_MASK     (0x0200U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPLO_SHIFT    (0x0009U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB3ZERO_MASK     (0x0400U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3ZERO_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB3ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_3_MASK     (0x0800U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_3_SHIFT    (0x000BU)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPHI_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPHI_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPLO_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPLO_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_PPB4ZERO_MASK     (0x4000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4ZERO_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_PPB4ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_4_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_4_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTCLR_RESERVED_4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTCLR_RESETVAL (0x0000U)

/* ADCEVTSEL */

#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPHI_MASK     (0x0001U)
#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPHI_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPLO_MASK     (0x0002U)
#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPLO_SHIFT    (0x0001U)
#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTSEL_PPB1TRIPLO_MAX      (0x0001U)

