TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_3_MASK     (0x0800U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_3_SHIFT    (0x000BU)
#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_3_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_3_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPHI_MASK     (0x1000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPHI_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPHI_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPHI_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPLO_MASK     (0x2000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPLO_SHIFT    (0x000DU)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPLO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4TRIPLO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4ZERO_MASK     (0x4000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4ZERO_SHIFT    (0x000EU)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4ZERO_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_PPB4ZERO_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_4_MASK     (0x8000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_4_SHIFT    (0x000FU)
#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_4_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCEVTINTSEL_RESERVED_4_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCEVTINTSEL_RESETVAL (0x0000U)

/* ADCOSDETECT */

#define MCAL_CSL_ADC_ADCOSDETECT_DETECTCFG_MASK     (0x0007U)
#define MCAL_CSL_ADC_ADCOSDETECT_DETECTCFG_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCOSDETECT_DETECTCFG_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCOSDETECT_DETECTCFG_MAX      (0x0007U)

#define MCAL_CSL_ADC_ADCOSDETECT_RESERVED_1_MASK     (0xFFF8U)
#define MCAL_CSL_ADC_ADCOSDETECT_RESERVED_1_SHIFT    (0x0003U)
#define MCAL_CSL_ADC_ADCOSDETECT_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCOSDETECT_RESERVED_1_MAX      (0x1FFFU)

#define MCAL_CSL_ADC_ADCOSDETECT_RESETVAL (0x0000U)

/* ADCCOUNTER */

#define MCAL_CSL_ADC_ADCCOUNTER_FREECOUNT_MASK     (0x0FFFU)
#define MCAL_CSL_ADC_ADCCOUNTER_FREECOUNT_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCCOUNTER_FREECOUNT_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCOUNTER_FREECOUNT_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCCOUNTER_RESERVED_1_MASK     (0xF000U)
#define MCAL_CSL_ADC_ADCCOUNTER_RESERVED_1_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCCOUNTER_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCCOUNTER_RESERVED_1_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCCOUNTER_RESETVAL (0x0000U)

/* ADCREV */

#define MCAL_CSL_ADC_ADCREV_TYPE_MASK     (0x00FFU)
#define MCAL_CSL_ADC_ADCREV_TYPE_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCREV_TYPE_RESETVAL (0x0005U)
#define MCAL_CSL_ADC_ADCREV_TYPE_MAX      (0x00FFU)

#define MCAL_CSL_ADC_ADCREV_REV_MASK     (0xFF00U)
#define MCAL_CSL_ADC_ADCREV_REV_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCREV_REV_RESETVAL (0x0001U)
#define MCAL_CSL_ADC_ADCREV_REV_MAX      (0x00FFU)

#define MCAL_CSL_ADC_ADCREV_RESETVAL (0x0105U)

/* ADCOFFTRIM */

#define MCAL_CSL_ADC_ADCOFFTRIM_OFFTRIM_MASK     (0x00FFU)
#define MCAL_CSL_ADC_ADCOFFTRIM_OFFTRIM_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCOFFTRIM_OFFTRIM_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCOFFTRIM_OFFTRIM_MAX      (0x00FFU)

#define MCAL_CSL_ADC_ADCOFFTRIM_RESERVED_1_MASK     (0xFF00U)
#define MCAL_CSL_ADC_ADCOFFTRIM_RESERVED_1_SHIFT    (0x0008U)
#define MCAL_CSL_ADC_ADCOFFTRIM_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCOFFTRIM_RESERVED_1_MAX      (0x00FFU)

#define MCAL_CSL_ADC_ADCOFFTRIM_RESETVAL (0x0000U)

/* ADCCONFIG */

#define MCAL_CSL_ADC_ADCCONFIG_CONFIG_MASK     (0xFFFFFFFFU)
#define MCAL_CSL_ADC_ADCCONFIG_CONFIG_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCCONFIG_CONFIG_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCCONFIG_CONFIG_MAX      (0xFFFFFFFFU)

#define MCAL_CSL_ADC_ADCCONFIG_RESETVAL (0x00000000U)

/* ADCPPB1CONFIG */

#define MCAL_CSL_ADC_ADCPPB1CONFIG_CONFIG_MASK     (0x000FU)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_CONFIG_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_CONFIG_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_CONFIG_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB1CONFIG_TWOSCOMPEN_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_TWOSCOMPEN_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_TWOSCOMPEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_TWOSCOMPEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB1CONFIG_CBCEN_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_CBCEN_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_CBCEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_CBCEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB1CONFIG_RESERVED_1_MASK     (0xFFC0U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_RESERVED_1_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1CONFIG_RESERVED_1_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB1CONFIG_RESETVAL (0x0000U)

/* ADCPPB1STAMP */

#define MCAL_CSL_ADC_ADCPPB1STAMP_DLYSTAMP_MASK     (0x0FFFU)
#define MCAL_CSL_ADC_ADCPPB1STAMP_DLYSTAMP_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1STAMP_DLYSTAMP_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1STAMP_DLYSTAMP_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCPPB1STAMP_RESERVED_1_MASK     (0xF000U)
#define MCAL_CSL_ADC_ADCPPB1STAMP_RESERVED_1_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCPPB1STAMP_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1STAMP_RESERVED_1_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB1STAMP_RESETVAL (0x0000U)

/* ADCPPB1OFFCAL */

#define MCAL_CSL_ADC_ADCPPB1OFFCAL_OFFCAL_MASK     (0x03FFU)
#define MCAL_CSL_ADC_ADCPPB1OFFCAL_OFFCAL_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1OFFCAL_OFFCAL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1OFFCAL_OFFCAL_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB1OFFCAL_RESERVED_1_MASK     (0xFC00U)
#define MCAL_CSL_ADC_ADCPPB1OFFCAL_RESERVED_1_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCPPB1OFFCAL_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1OFFCAL_RESERVED_1_MAX      (0x003FU)

#define MCAL_CSL_ADC_ADCPPB1OFFCAL_RESETVAL (0x0000U)

