TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
/* ADCPPB1OFFREF */

#define MCAL_CSL_ADC_ADCPPB1OFFREF_OFFREF_MASK     (0xFFFFU)
#define MCAL_CSL_ADC_ADCPPB1OFFREF_OFFREF_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1OFFREF_OFFREF_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB1OFFREF_OFFREF_MAX      (0xFFFFU)

#define MCAL_CSL_ADC_ADCPPB1OFFREF_RESETVAL (0x0000U)

/* ADCPPB1TRIPHI */

#define MCAL_CSL_ADC_ADCPPB1TRIPHI_LIMITHI_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_LIMITHI_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_LIMITHI_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_LIMITHI_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB1TRIPHI_HSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_HSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_HSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_HSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB1TRIPHI_RESERVED_1_MASK     (0xFFFE0000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPHI_RESERVED_1_MAX      (0x00007FFFU)

#define MCAL_CSL_ADC_ADCPPB1TRIPHI_RESETVAL (0x00000000U)

/* ADCPPB1TRIPLO */

#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LIMITLO_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LIMITLO_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LIMITLO_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LIMITLO_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_LSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB1TRIPLO_RESERVED_1_MASK     (0x000E0000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_RESERVED_1_MAX      (0x00000007U)

#define MCAL_CSL_ADC_ADCPPB1TRIPLO_REQSTAMP_MASK     (0xFFF00000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_REQSTAMP_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_REQSTAMP_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB1TRIPLO_REQSTAMP_MAX      (0x00000FFFU)

#define MCAL_CSL_ADC_ADCPPB1TRIPLO_RESETVAL (0x00000000U)

/* ADCPPB2CONFIG */

#define MCAL_CSL_ADC_ADCPPB2CONFIG_CONFIG_MASK     (0x000FU)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_CONFIG_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_CONFIG_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_CONFIG_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB2CONFIG_TWOSCOMPEN_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_TWOSCOMPEN_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_TWOSCOMPEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_TWOSCOMPEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB2CONFIG_CBCEN_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_CBCEN_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_CBCEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_CBCEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB2CONFIG_RESERVED_1_MASK     (0xFFC0U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_RESERVED_1_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2CONFIG_RESERVED_1_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB2CONFIG_RESETVAL (0x0000U)

/* ADCPPB2STAMP */

#define MCAL_CSL_ADC_ADCPPB2STAMP_DLYSTAMP_MASK     (0x0FFFU)
#define MCAL_CSL_ADC_ADCPPB2STAMP_DLYSTAMP_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2STAMP_DLYSTAMP_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2STAMP_DLYSTAMP_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCPPB2STAMP_RESERVED_1_MASK     (0xF000U)
#define MCAL_CSL_ADC_ADCPPB2STAMP_RESERVED_1_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCPPB2STAMP_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2STAMP_RESERVED_1_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB2STAMP_RESETVAL (0x0000U)

/* ADCPPB2OFFCAL */

#define MCAL_CSL_ADC_ADCPPB2OFFCAL_OFFCAL_MASK     (0x03FFU)
#define MCAL_CSL_ADC_ADCPPB2OFFCAL_OFFCAL_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2OFFCAL_OFFCAL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2OFFCAL_OFFCAL_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB2OFFCAL_RESERVED_1_MASK     (0xFC00U)
#define MCAL_CSL_ADC_ADCPPB2OFFCAL_RESERVED_1_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCPPB2OFFCAL_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2OFFCAL_RESERVED_1_MAX      (0x003FU)

#define MCAL_CSL_ADC_ADCPPB2OFFCAL_RESETVAL (0x0000U)

/* ADCPPB2OFFREF */

#define MCAL_CSL_ADC_ADCPPB2OFFREF_OFFREF_MASK     (0xFFFFU)
#define MCAL_CSL_ADC_ADCPPB2OFFREF_OFFREF_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2OFFREF_OFFREF_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB2OFFREF_OFFREF_MAX      (0xFFFFU)

#define MCAL_CSL_ADC_ADCPPB2OFFREF_RESETVAL (0x0000U)

/* ADCPPB2TRIPHI */

#define MCAL_CSL_ADC_ADCPPB2TRIPHI_LIMITHI_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_LIMITHI_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_LIMITHI_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_LIMITHI_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB2TRIPHI_HSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_HSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_HSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_HSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB2TRIPHI_RESERVED_1_MASK     (0xFFFE0000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPHI_RESERVED_1_MAX      (0x00007FFFU)

#define MCAL_CSL_ADC_ADCPPB2TRIPHI_RESETVAL (0x00000000U)

/* ADCPPB2TRIPLO */

#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LIMITLO_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LIMITLO_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LIMITLO_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LIMITLO_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_LSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB2TRIPLO_RESERVED_1_MASK     (0x000E0000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_RESERVED_1_MAX      (0x00000007U)

#define MCAL_CSL_ADC_ADCPPB2TRIPLO_REQSTAMP_MASK     (0xFFF00000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_REQSTAMP_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_REQSTAMP_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB2TRIPLO_REQSTAMP_MAX      (0x00000FFFU)

#define MCAL_CSL_ADC_ADCPPB2TRIPLO_RESETVAL (0x00000000U)

