TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
/* ADCPPB3CONFIG */

#define MCAL_CSL_ADC_ADCPPB3CONFIG_CONFIG_MASK     (0x000FU)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_CONFIG_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_CONFIG_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_CONFIG_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB3CONFIG_TWOSCOMPEN_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_TWOSCOMPEN_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_TWOSCOMPEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_TWOSCOMPEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB3CONFIG_CBCEN_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_CBCEN_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_CBCEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_CBCEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB3CONFIG_RESERVED_1_MASK     (0xFFC0U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_RESERVED_1_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3CONFIG_RESERVED_1_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB3CONFIG_RESETVAL (0x0000U)

/* ADCPPB3STAMP */

#define MCAL_CSL_ADC_ADCPPB3STAMP_DLYSTAMP_MASK     (0x0FFFU)
#define MCAL_CSL_ADC_ADCPPB3STAMP_DLYSTAMP_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3STAMP_DLYSTAMP_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3STAMP_DLYSTAMP_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCPPB3STAMP_RESERVED_1_MASK     (0xF000U)
#define MCAL_CSL_ADC_ADCPPB3STAMP_RESERVED_1_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCPPB3STAMP_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3STAMP_RESERVED_1_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB3STAMP_RESETVAL (0x0000U)

/* ADCPPB3OFFCAL */

#define MCAL_CSL_ADC_ADCPPB3OFFCAL_OFFCAL_MASK     (0x03FFU)
#define MCAL_CSL_ADC_ADCPPB3OFFCAL_OFFCAL_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3OFFCAL_OFFCAL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3OFFCAL_OFFCAL_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB3OFFCAL_RESERVED_1_MASK     (0xFC00U)
#define MCAL_CSL_ADC_ADCPPB3OFFCAL_RESERVED_1_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCPPB3OFFCAL_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3OFFCAL_RESERVED_1_MAX      (0x003FU)

#define MCAL_CSL_ADC_ADCPPB3OFFCAL_RESETVAL (0x0000U)

/* ADCPPB3OFFREF */

#define MCAL_CSL_ADC_ADCPPB3OFFREF_OFFREF_MASK     (0xFFFFU)
#define MCAL_CSL_ADC_ADCPPB3OFFREF_OFFREF_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3OFFREF_OFFREF_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB3OFFREF_OFFREF_MAX      (0xFFFFU)

#define MCAL_CSL_ADC_ADCPPB3OFFREF_RESETVAL (0x0000U)

/* ADCPPB3TRIPHI */

#define MCAL_CSL_ADC_ADCPPB3TRIPHI_LIMITHI_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_LIMITHI_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_LIMITHI_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_LIMITHI_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB3TRIPHI_HSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_HSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_HSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_HSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB3TRIPHI_RESERVED_1_MASK     (0xFFFE0000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPHI_RESERVED_1_MAX      (0x00007FFFU)

#define MCAL_CSL_ADC_ADCPPB3TRIPHI_RESETVAL (0x00000000U)

/* ADCPPB3TRIPLO */

#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LIMITLO_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LIMITLO_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LIMITLO_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LIMITLO_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_LSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB3TRIPLO_RESERVED_1_MASK     (0x000E0000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_RESERVED_1_MAX      (0x00000007U)

#define MCAL_CSL_ADC_ADCPPB3TRIPLO_REQSTAMP_MASK     (0xFFF00000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_REQSTAMP_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_REQSTAMP_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB3TRIPLO_REQSTAMP_MAX      (0x00000FFFU)

#define MCAL_CSL_ADC_ADCPPB3TRIPLO_RESETVAL (0x00000000U)

/* ADCPPB4CONFIG */

#define MCAL_CSL_ADC_ADCPPB4CONFIG_CONFIG_MASK     (0x000FU)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_CONFIG_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_CONFIG_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_CONFIG_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB4CONFIG_TWOSCOMPEN_MASK     (0x0010U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_TWOSCOMPEN_SHIFT    (0x0004U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_TWOSCOMPEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_TWOSCOMPEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB4CONFIG_CBCEN_MASK     (0x0020U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_CBCEN_SHIFT    (0x0005U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_CBCEN_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_CBCEN_MAX      (0x0001U)

#define MCAL_CSL_ADC_ADCPPB4CONFIG_RESERVED_1_MASK     (0xFFC0U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_RESERVED_1_SHIFT    (0x0006U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4CONFIG_RESERVED_1_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB4CONFIG_RESETVAL (0x0000U)

/* ADCPPB4STAMP */

#define MCAL_CSL_ADC_ADCPPB4STAMP_DLYSTAMP_MASK     (0x0FFFU)
#define MCAL_CSL_ADC_ADCPPB4STAMP_DLYSTAMP_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4STAMP_DLYSTAMP_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4STAMP_DLYSTAMP_MAX      (0x0FFFU)

#define MCAL_CSL_ADC_ADCPPB4STAMP_RESERVED_1_MASK     (0xF000U)
#define MCAL_CSL_ADC_ADCPPB4STAMP_RESERVED_1_SHIFT    (0x000CU)
#define MCAL_CSL_ADC_ADCPPB4STAMP_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4STAMP_RESERVED_1_MAX      (0x000FU)

#define MCAL_CSL_ADC_ADCPPB4STAMP_RESETVAL (0x0000U)

/* ADCPPB4OFFCAL */

#define MCAL_CSL_ADC_ADCPPB4OFFCAL_OFFCAL_MASK     (0x03FFU)
#define MCAL_CSL_ADC_ADCPPB4OFFCAL_OFFCAL_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4OFFCAL_OFFCAL_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4OFFCAL_OFFCAL_MAX      (0x03FFU)

#define MCAL_CSL_ADC_ADCPPB4OFFCAL_RESERVED_1_MASK     (0xFC00U)
#define MCAL_CSL_ADC_ADCPPB4OFFCAL_RESERVED_1_SHIFT    (0x000AU)
#define MCAL_CSL_ADC_ADCPPB4OFFCAL_RESERVED_1_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4OFFCAL_RESERVED_1_MAX      (0x003FU)

#define MCAL_CSL_ADC_ADCPPB4OFFCAL_RESETVAL (0x0000U)

