TexasInstruments/mcal_am263x/mcal/Adc/V0/Adc_Reg.h
/* ADCPPB4OFFREF */

#define MCAL_CSL_ADC_ADCPPB4OFFREF_OFFREF_MASK     (0xFFFFU)
#define MCAL_CSL_ADC_ADCPPB4OFFREF_OFFREF_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4OFFREF_OFFREF_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCPPB4OFFREF_OFFREF_MAX      (0xFFFFU)

#define MCAL_CSL_ADC_ADCPPB4OFFREF_RESETVAL (0x0000U)

/* ADCPPB4TRIPHI */

#define MCAL_CSL_ADC_ADCPPB4TRIPHI_LIMITHI_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_LIMITHI_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_LIMITHI_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_LIMITHI_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB4TRIPHI_HSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_HSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_HSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_HSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB4TRIPHI_RESERVED_1_MASK     (0xFFFE0000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPHI_RESERVED_1_MAX      (0x00007FFFU)

#define MCAL_CSL_ADC_ADCPPB4TRIPHI_RESETVAL (0x00000000U)

/* ADCPPB4TRIPLO */

#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LIMITLO_MASK     (0x0000FFFFU)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LIMITLO_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LIMITLO_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LIMITLO_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LSIGN_MASK     (0x00010000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LSIGN_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LSIGN_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_LSIGN_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCPPB4TRIPLO_RESERVED_1_MASK     (0x000E0000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_RESERVED_1_SHIFT    (0x00000011U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_RESERVED_1_MAX      (0x00000007U)

#define MCAL_CSL_ADC_ADCPPB4TRIPLO_REQSTAMP_MASK     (0xFFF00000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_REQSTAMP_SHIFT    (0x00000014U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_REQSTAMP_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCPPB4TRIPLO_REQSTAMP_MAX      (0x00000FFFU)

#define MCAL_CSL_ADC_ADCPPB4TRIPLO_RESETVAL (0x00000000U)

/* ADCINTCYCLE */

#define MCAL_CSL_ADC_ADCINTCYCLE_DELAY_MASK     (0xFFFFU)
#define MCAL_CSL_ADC_ADCINTCYCLE_DELAY_SHIFT    (0x0000U)
#define MCAL_CSL_ADC_ADCINTCYCLE_DELAY_RESETVAL (0x0000U)
#define MCAL_CSL_ADC_ADCINTCYCLE_DELAY_MAX      (0xFFFFU)

#define MCAL_CSL_ADC_ADCINTCYCLE_RESETVAL (0x0000U)

/* ADCINLTRIM1 */

#define MCAL_CSL_ADC_ADCINLTRIM1_INLTRIM31TO0_MASK     (0xFFFFFFFFU)
#define MCAL_CSL_ADC_ADCINLTRIM1_INLTRIM31TO0_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM1_INLTRIM31TO0_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM1_INLTRIM31TO0_MAX      (0xFFFFFFFFU)

#define MCAL_CSL_ADC_ADCINLTRIM1_RESETVAL (0x00000000U)

/* ADCINLTRIM2 */

#define MCAL_CSL_ADC_ADCINLTRIM2_INLTRIM63TO32_MASK     (0xFFFFFFFFU)
#define MCAL_CSL_ADC_ADCINLTRIM2_INLTRIM63TO32_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM2_INLTRIM63TO32_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM2_INLTRIM63TO32_MAX      (0xFFFFFFFFU)

#define MCAL_CSL_ADC_ADCINLTRIM2_RESETVAL (0x00000000U)

/* ADCINLTRIM3 */

#define MCAL_CSL_ADC_ADCINLTRIM3_INLTRIM95TO64_MASK     (0xFFFFFFFFU)
#define MCAL_CSL_ADC_ADCINLTRIM3_INLTRIM95TO64_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM3_INLTRIM95TO64_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM3_INLTRIM95TO64_MAX      (0xFFFFFFFFU)

#define MCAL_CSL_ADC_ADCINLTRIM3_RESETVAL (0x00000000U)

/* ADCINLTRIM4 */

#define MCAL_CSL_ADC_ADCINLTRIM4_INLTRIM127TO96_MASK     (0xFFFFFFFFU)
#define MCAL_CSL_ADC_ADCINLTRIM4_INLTRIM127TO96_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM4_INLTRIM127TO96_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM4_INLTRIM127TO96_MAX      (0xFFFFFFFFU)

#define MCAL_CSL_ADC_ADCINLTRIM4_RESETVAL (0x00000000U)

/* ADCINLTRIM5 */

#define MCAL_CSL_ADC_ADCINLTRIM5_INLTRIM159TO128_MASK     (0xFFFFFFFFU)
#define MCAL_CSL_ADC_ADCINLTRIM5_INLTRIM159TO128_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM5_INLTRIM159TO128_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM5_INLTRIM159TO128_MAX      (0xFFFFFFFFU)

#define MCAL_CSL_ADC_ADCINLTRIM5_RESETVAL (0x00000000U)

/* ADCINLTRIM6 */

#define MCAL_CSL_ADC_ADCINLTRIM6_INLTRIM191TO160_MASK     (0xFFFFFFFFU)
#define MCAL_CSL_ADC_ADCINLTRIM6_INLTRIM191TO160_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM6_INLTRIM191TO160_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIM6_INLTRIM191TO160_MAX      (0xFFFFFFFFU)

#define MCAL_CSL_ADC_ADCINLTRIM6_RESETVAL (0x00000000U)

/* ADCINLTRIMCTL */

#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBMODE_MASK     (0x00000001U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBMODE_SHIFT    (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBMODE_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBMODE_MAX      (0x00000001U)

#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBSTEP_MASK     (0x0000003EU)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBSTEP_SHIFT    (0x00000001U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBSTEP_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_CALIBSTEP_MAX      (0x0000001FU)

#define MCAL_CSL_ADC_ADCINLTRIMCTL_RESERVED_1_MASK     (0x0000FFC0U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_RESERVED_1_SHIFT    (0x00000006U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_RESERVED_1_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_RESERVED_1_MAX      (0x000003FFU)

#define MCAL_CSL_ADC_ADCINLTRIMCTL_KEY_MASK     (0xFFFF0000U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_KEY_SHIFT    (0x00000010U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_KEY_RESETVAL (0x00000000U)
#define MCAL_CSL_ADC_ADCINLTRIMCTL_KEY_MAX      (0x0000FFFFU)

#define MCAL_CSL_ADC_ADCINLTRIMCTL_RESETVAL (0x00000000U)

#ifdef __cplusplus
}
#endif
#endif
